<template>
<article>
  <h1>.auth</h1>
</article>
</template>

<script setup>
// TODO: 접근할때 db에서 인증 프로바이더 데이터가 들어있는지 검사한다.
// TODO: 데이터가 있다면 각 프로바이더 고유 아이디가 맞다면 로그인, 아니라면 인증실패
// TODO: 데이터가 없고 인증 통과가 된다면 프로바이더를 만들고 로그인

// TODO: .env 에서 인증에 필요한 값이 없을때가 있다.
// TODO: 먼저 API에 요청해보는데 프로바이더 값이 없다면 설치모드로 시작하는데 .env 값이 없으면 그에 해당되는 인증 서비스는 이용할 수 없어야 하는게 맞다.
// TODO: 인증 준비되어 있지 않으면 버튼이 비활성화 되어있거나 표시안되어 있어야 한다. 전부 없으면 설정이 완료되지 않았다고 메시지를 표시해주는게 좋을것이다.
// TODO: 인증 관련되어서 준비 안되어 있으면 인증 페이지만 막으면 될것이다.
</script>
